# Константы для тестирования веб-сервиса "Stellar Burgers"

# Состояния и тексты
ACTIVE = 'current'  # Класс активного элемента
WARNING = 'Некорректный пароль'  # Сообщение об ошибке для некорректного пароля

# Тексты для проверки интерфейса
CONSTRUCTOR_HEADER = 'Соберите бургер'  # Заголовок конструктора бургеров
PERSONAL_ACCOUNT_TEXT = (
    'В этом разделе вы можете изменить свои персональные данные'
)  # Текст в личном кабинете
SIGN_IN_FORM_TITLE = 'Вход'  # Заголовок формы входа

# Данные пользователя
USER_NAME = 'Глеб'  # Имя пользователя
EMAIL = 'glebkharitonenkov15777@yandex.ru'  # Электронная почта пользователя
PASSWORD = "password"  # Корректный пароль
INVALID_PASSWORD = '12'  # Некорректный пароль

# URL-адреса
MAIN_PAGE = 'https://stellarburgers.nomoreparties.site/'  # Главная страница